In [7]:
import pandas as pd

In [68]:
src_data = "names/"

In [115]:
def read_data(years):
    df_years = []
    for year in years:
        df = pd.read_csv(f'{src_data}yob{str(year)}.txt', header=None, names=['Name','Gender','Count'])
        df['Year'] = year
        df_years.append(df)        
    return df_years

In [126]:
def count_top3(years):
    df_all = pd.concat(read_data(years)).drop(['Year'],axis=1)
    return df_all.groupby(['Name']).sum().sort_values(by='Count', ascending=False).head(3)

In [127]:
count_top3([1900,1950,2000])

         Count
Name
James   111789
John    109601
Robert  101368

In [67]:
count_top3([1880])

         Count
Name
John      9701
William   9562
Mary      7092

In [158]:
def count_dynamics(years):
    df_all = pd.concat(read_data(years))   
    df_all.set_index(['Year'],inplace=True)
    return df_all.groupby(['Year','Gender']).sum().unstack('Year')

In [160]:
count_dynamics([1900,1950,2000])

         Count
Year      1900     1950     2000
Gender
F       299798  1713065  1815295
M       150480  1790437  1963202